app/controllers/api/v1/registrations_controller.rb

INSERT INTO "users" ("email", "password_digest", "timezone", "display_name", "created_at", "updated_at") VALUES ('tu@example.com', '$2a$12$ycD6Jx7NctzH.NEdKNwEMOYrg5SbOmJ7y7z5tmY4SfhiJ8AKjBWnK', 'Europe/Lisbon', 'Tu', '2026-05-12 01:44:33.771078', '2026-05-12 01:44:33.771078') RETURNING "id"
---
            def create
                user = User.new(user_params)
                if user.save