app/controllers/api/v1/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = '' LIMIT 1
---
            def create
                user = User.find_by(email: session_params[:email].to_s.strip.downcase)