app/controllers/concerns/authenticable.rb

    def current_user
        @current_user ||= begin
            header = request.headers["Authorization"].to_s
            token = header.split.last
            payload = JsonWebToken.decode(token)
            return nil unless payload && payload[:sub]

            User.find_by(id: payload[:sub])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1